app/Models/Learning.php

SELECT *
FROM `learning`
---
    public function getData()
    {
        return $this->findAll();

SELECT *
FROM `learning`
WHERE `id` = '8'
 LIMIT 1
---
    public function getDataById($id)
    {
        return $this->where(['id' => $id])->first();

INSERT INTO `learning` (`learning_topic`, `topic_category`, `learning_category`, `organizer`, `schedule`, `location`, `created_at`, `updated_at`) VALUES ('Coba', 'data', 'tes', 'hehe', 'ahah', 'caya', '2023-10-31 11:20:24', '2023-10-31 11:20:24')
---
    public function insertData($data)
    {
        return $this->save($data);

UPDATE `learning` SET `learning_topic` = 'Coba1233', `topic_category` = 'data123', `learning_category` = 'tesfer546', `organizer` = 'hehe', `schedule` = 'ahah', `location` = 'caya123', `updated_at` = '2023-10-31 11:20:53'
WHERE `learning`.`id` IN ('8')
---
    public function updateData($id, $data)
    {
        return $this->update($id, $data);

SELECT *
FROM `learning`
WHERE `learning`.`id` = '9'
DELETE FROM `learning`
WHERE `id` IN ('9')
---
    public function deleteData($id)
    {
        $learning = $this->find($id);
        return $this->delete($id);